{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[MASK]": 3,
      "A": 4,
      "C": 5,
      "G": 6,
      "U": 7,
      "AA": 8,
      "CG": 9,
      "AG": 10,
      "UU": 11,
      "UG": 12,
      "CAA": 13,
      "AC": 14,
      "GG": 15,
      "UC": 16,
      "UCG": 17,
      "CAACAA": 18,
      "GAA": 19,
      "CC": 20,
      "UAG": 21,
      "AAAA": 22,
      "UA": 23,
      "UAA": 24,
      "UUCG": 25,
      "UGG": 26,
      "CGAC": 27,
      "GAAA": 28,
      "UUG": 29,
      "AUG": 30,
      "UCGAG": 31,
      "UAGAG": 32,
      "GGGAA": 33,
      "UCGAAAA": 34,
      "CAACAAC": 35,
      "CGACUCGAG": 36,
      "UAGAGUCGAAAA": 37,
      "CGACUCGAGUAGAGUCGAAAA": 38,
      "CAACAACAACAAC": 39,
      "GGGAACGACUCGAGUAGAGUCGAAAA": 40,
      "CAG": 41,
      "AUU": 42,
      "UAC": 43,
      "GAAACAACAACAACAAC": 44,
      "ACG": 45,
      "CUG": 46,
      "CUU": 47,
      "AUC": 48,
      "CCG": 49,
      "AGG": 50,
      "CAAAA": 51,
      "CAC": 52,
      "CUC": 53,
      "AUA": 54,
      "CGG": 55,
      "UAAG": 56,
      "UCAA": 57,
      "CAAAAGAAACAACAACAACAAC": 58,
      "UUCGG": 59,
      "AAG": 60,
      "CA": 61,
      "AAAAGAAACAACAACAACAAC": 62,
      "GGG": 63,
      "AGAA": 64,
      "GGGAACGACUCGAGUAGAGUCGAAAAG": 65,
      "CUA": 66,
      "UUUU": 67,
      "CAAG": 68,
      "UCC": 69,
      "UGUU": 70,
      "UGUG": 71,
      "AUGG": 72,
      "UAUG": 73,
      "UUAA": 74,
      "AGGG": 75,
      "CGAA": 76,
      "CUCG": 77,
      "UUUG": 78,
      "AUCG": 79,
      "AGAG": 80,
      "ACAA": 81,
      "UAGG": 82,
      "CUGG": 83,
      "UUGG": 84,
      "AUAA": 85,
      "CAUG": 86,
      "AUAUGG": 87,
      "GAAAA": 88,
      "CUUCGG": 89,
      "UAAAA": 90,
      "UGGG": 91,
      "CAGG": 92,
      "UGAA": 93,
      "CAUU": 94,
      "CGAG": 95,
      "UCAG": 96,
      "CCAC": 97,
      "CUAC": 98,
      "AUUG": 99,
      "CACG": 100,
      "CUAA": 101,
      "UCAC": 102,
      "CGGG": 103,
      "UUAC": 104,
      "AUAG": 105,
      "CCAG": 106,
      "CCAA": 107,
      "CCUG": 108,
      "CUUG": 109,
      "CUAG": 110,
      "ACAC": 111,
      "UCUG": 112,
      "CGCG": 113,
      "UCUU": 114,
      "GAAG": 115,
      "CCGG": 116,
      "AUAC": 117,
      "UAUU": 118,
      "CAUC": 119,
      "ACGG": 120,
      "UUCGGG": 121,
      "UCGGAAA": 122,
      "UCGG": 123,
      "GGGAACGACUCGAGUAGAGUCGAAAAGAUAUGG": 124,
      "UGAG": 125,
      "UGAC": 126,
      "UCCUAAG": 127,
      "AGAAA": 128,
      "UCCG": 129,
      "UACG": 130,
      "AGAAACAACAACAACAAC": 131,
      "UAAAAGAAACAACAACAACAAC": 132,
      "GAAAAGAAACAACAACAACAAC": 133,
      "CCCG": 134,
      "ACAG": 135,
      "UUAG": 136,
      "CUAAG": 137,
      "UUCGCG": 138,
      "UCAAAA": 139,
      "CCUU": 140,
      "UGCG": 141,
      "CCUC": 142,
      "UCAAAAGAAACAACAACAACAAC": 143,
      "AGCG": 144,
      "AGUG": 145,
      "AUAUG": 146,
      "AGAC": 147,
      "UAUC": 148,
      "AGCC": 149,
      "UUCC": 150,
      "UGCC": 151,
      "UUCGCC": 152,
      "AUGAA": 153,
      "AUUCG": 154,
      "CUUCG": 155,
      "UCAAG": 156,
      "ACCG": 157,
      "UCUC": 158,
      "UAUA": 159,
      "GGAG": 160,
      "ACUG": 161,
      "GGAA": 162,
      "ACUU": 163,
      "UCCC": 164,
      "AGUU": 165,
      "UGAUG": 166,
      "CAGGG": 167,
      "UGUC": 168,
      "GGGAACGACUCGAGUAGAGUCGAAAAAAAA": 169,
      "UGUUG": 170,
      "CGUU": 171,
      "CAUA": 172,
      "UCUUCGG": 173,
      "CAAGG": 174,
      "CCAAAAGAAACAACAACAACAAC": 175,
      "UCGGAAACG": 176,
      "UUUC": 177,
      "CGUG": 178,
      "AUAAG": 179,
      "ACCC": 180,
      "UGGAG": 181,
      "UAUAA": 182,
      "UCGGAAACGAC": 183,
      "ACAUG": 184,
      "CUUGG": 185,
      "CAGAG": 186,
      "CAUUG": 187,
      "CCCC": 188,
      "UGUUCG": 189,
      "UACAA": 190,
      "CAGAA": 191,
      "AAAAAGAAACAACAACAACAAC": 192,
      "GGGAACGACUCGAGUAGAGUCGAAAAAA": 193,
      "CUGGG": 194,
      "UAUUG": 195,
      "ACAAAAGAAACAACAACAACAAC": 196,
      "CUGAA": 197,
      "CUUCGGG": 198,
      "UCCUAAGUCAA": 199,
      "UUAUG": 200,
      "GAAACG": 201,
      "UGGUG": 202,
      "ACUC": 203,
      "CUCAA": 204,
      "AAAAG": 205,
      "AGGAG": 206,
      "UAGAA": 207,
      "UUUCG": 208,
      "CCGAA": 209,
      "CAUGG": 210,
      "AUAAAA": 211,
      "AUUGG": 212,
      "CCUUCGGG": 213,
      "AUCAA": 214,
      "AUUAA": 215,
      "CAUCG": 216,
      "CAGCG": 217,
      "ACGAA": 218,
      "UAUGG": 219,
      "UUUUG": 220,
      "ACUUCGG": 221,
      "UGCUG": 222,
      "UGAAG": 223,
      "AUGGG": 224,
      "GGGAACGACUCGAGUAGAGUCGAAAAGG": 225,
      "ACAAG": 226,
      "CUUAA": 227,
      "CAAAG": 228,
      "CAGCC": 229,
      "CGCC": 230,
      "UAAAG": 231,
      "CGUC": 232,
      "AUGAG": 233,
      "AUUUU": 234,
      "UAAGG": 235,
      "CCGGG": 236,
      "UACAG": 237,
      "AUGUUG": 238,
      "UAUAG": 239,
      "CACAA": 240,
      "UCGAA": 241,
      "AGUC": 242,
      "CCAAG": 243,
      "CCUUG": 244,
      "AUAUGGAA": 245,
      "UGUGG": 246,
      "CGUUCGCG": 247,
      "CUUUU": 248,
      "UAGGG": 249,
      "CUCGG": 250,
      "UUGUU": 251,
      "UAUAC": 252,
      "UACGG": 253,
      "CUUUG": 254,
      "AGUUCG": 255
    },
    "merges": [
      "A A",
      "C G",
      "A G",
      "U U",
      "U G",
      "C AA",
      "A C",
      "G G",
      "U C",
      "U CG",
      "CAA CAA",
      "G AA",
      "C C",
      "U AG",
      "AA AA",
      "U A",
      "U AA",
      "UU CG",
      "UG G",
      "CG AC",
      "GAA A",
      "UU G",
      "A UG",
      "UCG AG",
      "UAG AG",
      "GG GAA",
      "UCG AAAA",
      "CAACAA C",
      "CGAC UCGAG",
      "UAGAG UCGAAAA",
      "CGACUCGAG UAGAGUCGAAAA",
      "CAACAA CAACAAC",
      "GGGAA CGACUCGAGUAGAGUCGAAAA",
      "C AG",
      "A UU",
      "U AC",
      "GAAA CAACAACAACAAC",
      "A CG",
      "C UG",
      "C UU",
      "A UC",
      "C CG",
      "AG G",
      "CAA AA",
      "C AC",
      "C UC",
      "A UA",
      "CG G",
      "UAA G",
      "U CAA",
      "CAAAA GAAACAACAACAACAAC",
      "UUCG G",
      "AA G",
      "C A",
      "AAAA GAAACAACAACAACAAC",
      "GG G",
      "AG AA",
      "GGGAACGACUCGAGUAGAGUCGAAAA G",
      "C UA",
      "UU UU",
      "CAA G",
      "UC C",
      "UG UU",
      "UG UG",
      "A UGG",
      "UA UG",
      "UU AA",
      "AG GG",
      "CG AA",
      "C UCG",
      "UU UG",
      "A UCG",
      "AG AG",
      "A CAA",
      "UAG G",
      "C UGG",
      "UU GG",
      "A UAA",
      "C AUG",
      "AUA UGG",
      "GAA AA",
      "C UUCGG",
      "U AAAA",
      "UG GG",
      "CAG G",
      "UG AA",
      "C AUU",
      "CG AG",
      "UC AG",
      "CC AC",
      "C UAC",
      "A UUG",
      "C ACG",
      "C UAA",
      "UC AC",
      "CG GG",
      "UU AC",
      "A UAG",
      "CC AG",
      "C CAA",
      "CC UG",
      "C UUG",
      "C UAG",
      "AC AC",
      "UC UG",
      "CG CG",
      "UC UU",
      "GAA G",
      "CCG G",
      "A UAC",
      "UA UU",
      "C AUC",
      "ACG G",
      "UUCG GG",
      "UCG GAAA",
      "UCG G",
      "GGGAACGACUCGAGUAGAGUCGAAAAG AUAUGG",
      "UG AG",
      "UG AC",
      "UCC UAAG",
      "AGAA A",
      "UC CG",
      "UA CG",
      "AGAAA CAACAACAACAAC",
      "U AAAAGAAACAACAACAACAAC",
      "GAAAA GAAACAACAACAACAAC",
      "CC CG",
      "AC AG",
      "UU AG",
      "C UAAG",
      "UUCG CG",
      "U CAAAA",
      "CC UU",
      "UG CG",
      "CC UC",
      "U CAAAAGAAACAACAACAACAAC",
      "AG CG",
      "AG UG",
      "AUA UG",
      "AG AC",
      "UA UC",
      "AG CC",
      "UU CC",
      "UG CC",
      "UUCG CC",
      "AUG AA",
      "A UUCG",
      "C UUCG",
      "UCAA G",
      "AC CG",
      "UC UC",
      "UA UA",
      "GG AG",
      "AC UG",
      "GG AA",
      "AC UU",
      "UC CC",
      "AG UU",
      "UG AUG",
      "CAG GG",
      "UG UC",
      "GGGAACGACUCGAGUAGAGUCGAAAA AAAA",
      "UG UUG",
      "CG UU",
      "C AUA",
      "UC UUCGG",
      "CAA GG",
      "C CAAAAGAAACAACAACAACAAC",
      "UCGGAAA CG",
      "UU UC",
      "CG UG",
      "A UAAG",
      "AC CC",
      "UGG AG",
      "UA UAA",
      "UCGGAAA CGAC",
      "AC AUG",
      "CUU GG",
      "CAG AG",
      "CA UUG",
      "CC CC",
      "UG UUCG",
      "UA CAA",
      "CAG AA",
      "AAAA AGAAACAACAACAACAAC",
      "GGGAACGACUCGAGUAGAGUCGAAAA AA",
      "CUG GG",
      "UA UUG",
      "A CAAAAGAAACAACAACAACAAC",
      "CUG AA",
      "C UUCGGG",
      "UCCUAAG UCAA",
      "UU AUG",
      "GAAA CG",
      "UGG UG",
      "AC UC",
      "C UCAA",
      "AAAA G",
      "AGG AG",
      "UAG AA",
      "UU UCG",
      "CCG AA",
      "CA UGG",
      "A UAAAA",
      "AUU GG",
      "CC UUCGGG",
      "A UCAA",
      "AUU AA",
      "CA UCG",
      "CAG CG",
      "ACG AA",
      "UA UGG",
      "UU UUG",
      "AC UUCGG",
      "UG CUG",
      "UG AAG",
      "AUG GG",
      "GGGAACGACUCGAGUAGAGUCGAAAA GG",
      "A CAAG",
      "CUU AA",
      "CAA AG",
      "CAG CC",
      "CG CC",
      "UAA AG",
      "CG UC",
      "AUG AG",
      "AUU UU",
      "UAA GG",
      "CCG GG",
      "UAC AG",
      "AUG UUG",
      "UA UAG",
      "CA CAA",
      "UCG AA",
      "AG UC",
      "C CAAG",
      "CC UUG",
      "AUAUG GAA",
      "UG UGG",
      "CG UUCGCG",
      "CUU UU",
      "UAG GG",
      "CUCG G",
      "UUG UU",
      "UA UAC",
      "UA CGG",
      "CUU UG",
      "AG UUCG"
    ]
  }
}